name: "act_pick_place"
backend: "python"
max_batch_size: 0

input [
  {
    name: "state__0"
    data_type: TYPE_FP32
    dims: [ 1, 8 ]
  },
  {
    name: "image__1"
    data_type: TYPE_FP32
    dims: [ 1, 3, 480, 640 ]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 1, 8 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
