name: "act_pick_place"
platform: "pytorch_libtorch"
max_batch_size: 8

input [
  {
    name: "state__0"
    data_type: TYPE_FP32
    dims: [ 8 ]
  },
  {
    name: "image__1"
    data_type: TYPE_FP32
    dims: [ 3, 480, 640 ]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 8 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8 ]
  max_queue_delay_microseconds: 100
}
